#### House Price Prediction using Multi Variate Linear Regression

In [1]:
import pandas as pd
from sklearn import linear_model
import matplotlib.pyplot as plt

In [84]:
df = pd.read_csv("py-master/py-master/ML/2_linear_reg_multivariate/homeprices.csv")

In [85]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [87]:
df.bedrooms.median()

4.0

In [88]:
df.bedrooms = df.bedrooms.fillna(df.bedrooms.median())
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [89]:
reg = linear_model.LinearRegression()

In [90]:
reg.fit(df[['area', 'bedrooms', 'age']], df.price)

LinearRegression()

In [91]:
reg.coef_

array([  112.06244194, 23388.88007794, -3231.71790863])

In [92]:
reg.intercept_

221323.00186540408

In [93]:
reg.predict([[3200, 4, 18]])

array([615307.4140366])

In [94]:
reg.predict([[3000, 3, 40]])

array([498408.25158031])

In [119]:
reg.predict([[3000, 3, 4]])

array([614750.09629109])

In [121]:
reg.predict([[3000, 3, 10]])

array([595359.7888393])

Above houses has same size and same bedrooms but they do have different age so from that age our model is able to estimate the price in right manner. An old house price is has to be lesser than new consturcted house and our model is able to do that.

## Exercise for Hiring DataSet

In [45]:
df = pd.read_csv("py-master/py-master/ML/2_linear_reg_multivariate/Exercise/hiring.csv")

In [46]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [47]:
df["test_score(out of 10)"] = df["test_score(out of 10)"].fillna(df["test_score(out of 10)"].median())

In [48]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [49]:
df.experience = df.experience.fillna("zero")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [59]:
from word2number import w2n
df.experience = df.experience.apply(w2n.word_to_num)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [60]:
reg = linear_model.LinearRegression()

In [61]:
reg.fit(df[['experience','test_score(out of 10)','interview_score(out of 10)']],df["salary($)"])

LinearRegression()

In [63]:
reg.predict([[2,9,6]])

array([53205.96797671])